
## Plan Result (user-api-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/21193)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 0 to change, 3 to destroy.</code></pre>

* Create
  * aws_cloudwatch_log_group.aws-otel-collector-log-group
* Delete
  * aws_cloudwatch_log_group.application_ecs_service_ecs-aws-otel-collector_9F54C4B2
* Replace
  * aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4
  * local_file.application_ecs_service_appspec_94386B9C


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_cloudwatch_log_group.application_ecs_service_ecs-aws-otel-collector_9F54C4B2 will be destroyed
  # (because aws_cloudwatch_log_group.application_ecs_service_ecs-aws-otel-collector_9F54C4B2 is not in configuration)
  - resource "aws_cloudwatch_log_group" "application_ecs_service_ecs-aws-otel-collector_9F54C4B2" {
      - arn               = "arn:aws:logs:us-east-1:996905175585:log-group:/ecs/UserAPI-Prod/aws-otel-collector20221214211544952300000001" -> null
      - id                = "/ecs/UserAPI-Prod/aws-otel-collector20221214211544952300000001" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/ecs/UserAPI-Prod/aws-otel-collector20221214211544952300000001" -> null
      - name_prefix       = "/ecs/UserAPI-Prod/aws-otel-collector" -> null
      - retention_in_days = 30 -> null
      - skip_destroy      = false -> null
      - tags              = {
          - "environment" = "Prod"
          - "service"     = "UserAPI"
        } -> null
      - tags_all          = {
          - "environment" = "Prod"
          - "service"     = "UserAPI"
        } -> null
    }

  # aws_cloudwatch_log_group.aws-otel-collector-log-group will be created
  + resource "aws_cloudwatch_log_group" "aws-otel-collector-log-group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/Backend/UserAPI-Prod/ecs/aws-otel-collector"
      + name_prefix       = (known after apply)
      + retention_in_days = 90
      + skip_destroy      = true
      + tags              = {
          + "environment" = "Prod"
          + "service"     = "UserAPI"
        }
      + tags_all          = {
          + "environment" = "Prod"
          + "service"     = "UserAPI"
        }
    }

  # aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4 must be replaced
-/+ resource "aws_ecs_task_definition" "application_ecs_service_ecs-task_461CC9D4" {
      ~ arn                      = "arn:aws:ecs:us-east-1:996905175585:task-definition/UserAPI-Prod:255" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:996905175585:task-definition/UserAPI-Prod" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                    name                   = "app"
                  ~ portMappings           = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                    # (10 unchanged attributes hidden)
                },
              ~ {
                  ~ logConfiguration       = {
                      ~ options       = {
                          ~ awslogs-group             = "/ecs/UserAPI-Prod/aws-otel-collector20221214211544952300000001" -> "/Backend/UserAPI-Prod/ecs/aws-otel-collector"
                          + awslogs-multiline-pattern = "^\\S.+"
                            # (2 unchanged attributes hidden)
                        }
                        # (2 unchanged attributes hidden)
                    }
                    name                   = "aws-otel-collector"
                  ~ portMappings           = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                    # (9 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "UserAPI-Prod" -> (known after apply)
      ~ revision                 = 255 -> (known after apply)
        tags                     = {
            "environment" = "Prod"
            "service"     = "UserAPI"
        }
        # (9 unchanged attributes hidden)
    }

  # local_file.application_ecs_service_appspec_94386B9C must be replaced
-/+ resource "local_file" "application_ecs_service_appspec_94386B9C" {
      ~ content              = jsonencode(
            {
              - Resources = [
                  - {
                      - TargetService = {
                          - Properties = {
                              - LoadBalancerInfo = {
                                  - ContainerName = "app"
                                  - ContainerPort = 4006
                                }
                              - TaskDefinition   = "arn:aws:ecs:us-east-1:996905175585:task-definition/UserAPI-Prod:255"
                            }
                          - Type       = "AWS::ECS::Service"
                        }
                    },
                ]
              - version   = 1
            } # forces replacement
        ) -> (known after apply) # forces replacement
      ~ content_base64sha256 = "puICqlU8nHO+PLocGuHKc6IghsC3FyBDC2bbSLN4Sjg=" -> (known after apply)
      ~ content_base64sha512 = "Ym/9vD0nYlfPDKgFyXlN1X517hVkF4Urg2SUEWqBDHCBZ4vz/KH2TwhzMzPPPMZfeaQppu0AWcspfQKL5Q2p2g==" -> (known after apply)
      ~ content_md5          = "2145770b7b4afa45b3a5835f23c5417c" -> (known after apply)
      ~ content_sha1         = "2f4339a11f7f991a0ce44b8209544a03e7deb3c2" -> (known after apply)
      ~ content_sha256       = "a6e202aa553c9c73be3cba1c1ae1ca73a22086c0b71720430b66db48b3784a38" -> (known after apply)
      ~ content_sha512       = "626ffdbc3d276257cf0ca805c9794dd57e75ee156417852b836494116a810c7081678bf3fca1f64f08733333cf3cc65f79a429a6ed0059cb297d028be50da9da" -> (known after apply)
      ~ id                   = "2f4339a11f7f991a0ce44b8209544a03e7deb3c2" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 3 to add, 0 to change, 3 to destroy.
╷
│ Warning: Deprecated attribute
│ 
│   on cdk.tf.json line 1977, in resource.aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84:
│ 1977:         "endpoint": "https://events.pagerduty.com/integration/${pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5.integration_key}/enqueue",
│ 
│ The attribute "integration_key" is deprecated. Refer to the provider
│ documentation for details.
│ 
│ (and 3 more similar warnings elsewhere)
╵
```

</details>



## :warning: Warnings

```hcl
Warning: Deprecated attribute
 
   on cdk.tf.json line 1977, in resource.aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84:
 1977:         "endpoint": "https://events.pagerduty.com/integration/${pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5.integration_key}/enqueue",
 
 The attribute "integration_key" is deprecated. Refer to the provider
 documentation for details.
 
 (and 3 more similar warnings elsewhere)
```



<!-- github-comment: {"Command":"plan","JobID":"2a616970-dc05-4a05-b0fa-a6f03c5020fe","JobName":"user-api_infrastructure_plan_prod","PRNumber":87,"Program":"tfcmt","SHA1":"c4a98e673df7879af40f9fe36d014e95f1b9edc1","Target":"user-api-cdk","Vars":{}} -->